In [1]:
import pandas as pd
data=pd.read_excel('C:/Users/MSI/Desktop/training data/Emploi-FI.xls')
type(data)

pandas.core.frame.DataFrame

In [2]:
data

,Enseignant,Jours,Séance,Deb,Fin,Matière,Type,Salle,Régime,Section
0,ABDALLAH Abdelkader Iskander,3-Mercredi,S5,15h30,17h00,"7208-Programmation OO (IG, Threads, RMI, Socke...",TP,A distance,H,FIA1-01-1
1,ABDALLAH Abdelkader Iskander,3-Mercredi,S6,17h10,18h40,"7208-Programmation OO (IG, Threads, RMI, Socke...",TP,A distance,H,FIA1-01-1
2,ABDALLAH Abdelkader Iskander,4-Jeudi,S5,15h30,17h00,"7208-Programmation OO (IG, Threads, RMI, Socke...",TP,A distance,H,FIA1-04-1
3,ABDALLAH Abdelkader Iskander,4-Jeudi,S6,17h10,18h40,"7208-Programmation OO (IG, Threads, RMI, Socke...",TP,A distance,H,FIA1-04-1
4,ABDALLAH Abdelkader Iskander,5-Vendredi,S5,15h30,17h00,"7208-Programmation OO (IG, Threads, RMI, Socke...",TP,A distance,H,FIA1-01-1
...,...,...,...,...,...,...,...,...,...,...
283,ZARROUK Elyes,4-Jeudi,S4,13h50,15h20,7404-Web 2.0 et Web 3.0-FI-GL-SE4,C,I-02,H,FIA2-GL-01-1
284,ZINE EL ABIDINE Leila,1-Lundi,S3,11h50,13h20,7412-Français 4-FI-GL-SE4,C,K11,H,FIA2-GL-04-1
285,ZINE EL ABIDINE Leila,1-Lundi,S4,13h50,15h20,7412-Français 4-FI-GL-SE4,C,I-15,H,FIA2-GL-03-1
286,ZINE EL ABIDINE Leila,1-Lundi,S5,15h30,17h00,7412-Français 4-FI-GL-SE4,C,I-15,H,FIA2-GL-02-1
287,ZINE EL ABIDINE Leila,2-Mardi,S4,13h50,15h20,7412-Français 4-FI-GL-SE4,C,I-10,H,FIA2-GL-01-1

In [3]:
print(data.ndim)
print(data.shape)

2
(288, 10)

In [4]:
data.describe()

,Enseignant,Jours,Séance,Deb,Fin,Matière,Type,Salle,Régime,Section
count,288,288,288,288,288,288,288,288,288,288
unique,38,6,7,7,7,24,3,49,5,8
top,JEGHAM Walid,4-Jeudi,S3,11h50,13h20,"7411-Qualité, Audit, Gestion de projets (PMP)-...",TP,A distance,H,FIA2-GL-01-1
freq,24,71,55,55,55,24,144,32,148,39

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 288 entries, 0 to 287
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Enseignant  288 non-null    object
 1   Jours       288 non-null    object
 2   Séance      288 non-null    object
 3   Deb         288 non-null    object
 4   Fin         288 non-null    object
 5   Matière     288 non-null    object
 6   Type        288 non-null    object
 7   Salle       288 non-null    object
 8   Régime      288 non-null    object
 9   Section     288 non-null    object
dtypes: object(10)
memory usage: 22.6+ KB

In [6]:
data['Jours'].unique()

array(['3-Mercredi', '4-Jeudi', '5-Vendredi', '6-Samedi', '1-Lundi',
       '2-Mardi'], dtype=object)

In [7]:
data['Deb'].unique()

array(['15h30', '17h10', '11h50', '13h30', '08h30', '10h10', '13h50'],
      dtype=object)

In [10]:
import numpy as np
obj=pd.Series(np.arange(4))
obj.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
obj=pd.Series(['lyna'],index=['a'])
obj.index

Index(['a'], dtype='object')

In [13]:
obj

a    lyna
dtype: object

In [15]:
obj['a']

'lyna'

In [18]:
x=pd.Index(['a1','a2','a3'])

In [19]:
type(x)

pandas.core.indexes.base.Index

In [22]:
obj3=pd.Series(['lyna','rim','rihab'],index=x)

In [23]:
obj3

a1     lyna
a2      rim
a3    rihab
dtype: object

In [24]:
data={'col1':[1,2,3],'col2':['a','b','c']}#dictionnaire de listes
df=pd.DataFrame(data,index=['l1','l2','l3'])
df.columns# kifkif index

Index(['col1', 'col2'], dtype='object')

In [25]:
df#print(df)

    col1 col2
l1     1    a
l2     2    b
l3     3    c

In [29]:
df.index.is_unique

True

In [30]:
data={'col1':[1,2,3,''],'col2':['a','b','c','d']}
df=pd.DataFrame(data,index=['l1','l2','l3','l1'])
df.columns

Index(['col1', 'col2'], dtype='object')

In [31]:
df.index.is_unique

False

In [32]:
df.index.unique()#n'affiche pas eli myet3awdouch

Index(['l1', 'l2', 'l3'], dtype='object')

In [33]:
data=pd.DataFrame({'c1':[1,2,3],'c2':[4,5,6]},index=['l1','l2','l3'])
data

    c1  c2
l1   1   4
l2   2   5
l3   3   6

In [34]:
data.rename(columns={'c1':'Colonne1','c2':'Colonne2'},index={'l1':'Ligne1','l2':'Ligne2','l3':'Ligne3'},inplace=True)
#inplace=true ken man7othech itala3li wa7da o5ra jdida

In [35]:
data

        Colonne1  Colonne2
Ligne1         1         4
Ligne2         2         5
Ligne3         3         6

In [36]:
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df = pd.DataFrame({'http_status': [200, 200, 404, 404, 301],'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},index=index)
df

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [37]:
new_index = ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10','Chrome']
df.reindex(new_index)

               http_status  response_time
Safari               404.0           0.07
Iceweasel              NaN            NaN
Comodo Dragon          NaN            NaN
IE10                 404.0           0.08
Chrome               200.0           0.02

In [38]:
df#a3ta le9dym 5ter ma3melnech index=true

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [39]:
df.reindex(new_index, fill_value=0)

               http_status  response_time
Safari                 404           0.07
Iceweasel                0           0.00
Comodo Dragon            0           0.00
IE10                   404           0.08
Chrome                 200           0.02

In [40]:
df=pd.DataFrame({'col1':[1,2.5,3],'col2':[5.5,3.2,0]},index=[['a','a','b'],[1,2,3]])
df

     col1  col2
a 1   1.0   5.5
  2   2.5   3.2
b 3   3.0   0.0

In [41]:
data={'col1':[1,2,3],'col2':['a','b','c'],'col3':['Dalel','Sami','Mayssa']}
df=pd.DataFrame(data,index=['l1','l2','l3'])
df

    col1 col2    col3
l1     1    a   Dalel
l2     2    b    Sami
l3     3    c  Mayssa

In [42]:
df['col1']

l1    1
l2    2
l3    3
Name: col1, dtype: int64

In [43]:
type(df['col1'])

pandas.core.series.Series

In [44]:
df.loc[:,['col1','col3']]

    col1    col3
l1     1   Dalel
l2     2    Sami
l3     3  Mayssa

In [45]:
df.loc[:,'col2':'col3']

   col2    col3
l1    a   Dalel
l2    b    Sami
l3    c  Mayssa

In [46]:
df.iloc[:,[0,2]]

    col1    col3
l1     1   Dalel
l2     2    Sami
l3     3  Mayssa

In [47]:
df.iloc[:,1:]

   col2    col3
l1    a   Dalel
l2    b    Sami
l3    c  Mayssa

In [48]:
df.loc['l2']

col1       2
col2       b
col3    Sami
Name: l2, dtype: object

In [49]:
df.loc['l1':'l2']

    col1 col2   col3
l1     1    a  Dalel
l2     2    b   Sami

In [50]:
df.loc[['l1','l3']]

    col1 col2    col3
l1     1    a   Dalel
l3     3    c  Mayssa

In [51]:
df.iloc[1]

col1       2
col2       b
col3    Sami
Name: l2, dtype: object

In [52]:
df.iloc[0:2]

    col1 col2   col3
l1     1    a  Dalel
l2     2    b   Sami

In [53]:
df.iloc[[0,2]]

    col1 col2    col3
l1     1    a   Dalel
l3     3    c  Mayssa

In [54]:
df.at['l2','col3']

'Sami'

In [55]:
df.iat[1,2]#ordre par ligne colonne

'Sami'

In [56]:
df.loc[df['col1']>=2]

    col1 col2    col3
l2     2    b    Sami
l3     3    c  Mayssa

In [60]:
df.loc[df['col1']>=2,'col2']

l2    b
l3    c
Name: col2, dtype: object

In [66]:
df.loc[(df['col1']>=2)&(df.loc['l2']=='c')]

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [58]:
df.loc[df['col1']>=2,df.loc['l2']=='b']

   col2
l2    b
l3    c

In [68]:
from numpy import nan #fonction wa7da men numpy
df['col3']=nan

In [69]:
df

    col1 col2  col3
l1     1    a   NaN
l2     2    b   NaN
l3     3    c   NaN

In [70]:
from numpy import nan as NA
df=pd.DataFrame([[1.5,NA],[5.2,7.6],[NA,NA],[2.3,0.25]],index=['l1','l2','l3','l4'], columns= ['c1','c2'])
df

     c1    c2
l1  1.5   NaN
l2  5.2  7.60
l3  NaN   NaN
l4  2.3  0.25

In [73]:
df=pd.read_excel('C:/Users/MSI/Desktop/training data/File.xls')
df

        c1    c2
0      1.5   NaN
1      5.2   7.6
2      NaN  vide
3      2.3  0.25
4  missing   NaN

In [74]:
missing_values =['missing','vide'] 
df=pd.read_excel('File.xls',na_values=missing_values)
df

    c1    c2
0  1.5   NaN
1  5.2  7.60
2  NaN   NaN
3  2.3  0.25
4  NaN   NaN

In [78]:
from numpy import nan
df['c3']=NA
df

    c1    c2  c3
0  1.5   NaN NaN
1  5.2  7.60 NaN
2  NaN   NaN NaN
3  2.3  0.25 NaN
4  NaN   NaN NaN

In [79]:
df.loc[5]=1

In [80]:
df

    c1    c2   c3
0  1.5   NaN  NaN
1  5.2  7.60  NaN
2  NaN   NaN  NaN
3  2.3  0.25  NaN
4  NaN   NaN  NaN
5  1.0  1.00  1.0

In [82]:
df2=df.copy(deep=True)#deep=true lezma bech mta"melch referance 3ala lo5ra

In [83]:
df2

    c1    c2   c3
0  1.5   NaN  NaN
1  5.2  7.60  NaN
2  NaN   NaN  NaN
3  2.3  0.25  NaN
4  NaN   NaN  NaN
5  1.0  1.00  1.0

In [88]:
df2.iloc[:]=19
df2

     c1    c2    c3
0  19.0  19.0  19.0
1  19.0  19.0  19.0
2  19.0  19.0  19.0
3  19.0  19.0  19.0
4  19.0  19.0  19.0
5  19.0  19.0  19.0

In [85]:
df

    c1    c2   c3
0  1.5   NaN  NaN
1  5.2  7.60  NaN
2  NaN   NaN  NaN
3  2.3  0.25  NaN
4  NaN   NaN  NaN
5  1.0  1.00  1.0

In [86]:
df.dropna()

    c1   c2   c3
5  1.0  1.0  1.0

In [87]:
df

    c1    c2   c3
0  1.5   NaN  NaN
1  5.2  7.60  NaN
2  NaN   NaN  NaN
3  2.3  0.25  NaN
4  NaN   NaN  NaN
5  1.0  1.00  1.0

In [89]:
df.dropna(how='all')

    c1    c2   c3
0  1.5   NaN  NaN
1  5.2  7.60  NaN
3  2.3  0.25  NaN
5  1.0  1.00  1.0

In [90]:
df.dropna(thresh=2)

    c1    c2   c3
1  5.2  7.60  NaN
3  2.3  0.25  NaN
5  1.0  1.00  1.0

In [91]:
#utilisons l'exmple précédent
df.fillna(0)

    c1    c2   c3
0  1.5  0.00  0.0
1  5.2  7.60  0.0
2  0.0  0.00  0.0
3  2.3  0.25  0.0
4  0.0  0.00  0.0
5  1.0  1.00  1.0

In [92]:
df.fillna({'c1':0.33,'c2':0.66,'c3':0.99})

     c1    c2    c3
0  1.50  0.66  0.99
1  5.20  7.60  0.99
2  0.33  0.66  0.99
3  2.30  0.25  0.99
4  0.33  0.66  0.99
5  1.00  1.00  1.00

In [94]:
df.fillna(method='bfill')

    c1    c2   c3
0  1.5  7.60  1.0
1  5.2  7.60  1.0
2  2.3  0.25  1.0
3  2.3  0.25  1.0
4  1.0  1.00  1.0
5  1.0  1.00  1.0

In [95]:
df.fillna(method='ffill')

    c1    c2   c3
0  1.5   NaN  NaN
1  5.2  7.60  NaN
2  5.2  7.60  NaN
3  2.3  0.25  NaN
4  2.3  0.25  NaN
5  1.0  1.00  1.0

In [96]:
data=pd.DataFrame({'c1':[1,1,2,3,3,4],'c2':['a','b','c','d','d','d']})
data.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [97]:
#recherche et suppression des lignes dupliquées
data.drop_duplicates()

   c1 c2
0   1  a
1   1  b
2   2  c
3   3  d
5   4  d

In [98]:
#Supression de duplicats selon un ou plusieurs colonnes
data.drop_duplicates(['c2'])

   c1 c2
0   1  a
1   1  b
2   2  c
3   3  d

In [100]:
data.drop_duplicates(ignore_index=True)

   c1 c2
0   1  a
1   1  b
2   2  c
3   3  d
4   4  d

In [102]:
data2=data.drop_duplicates(['c2'], keep='last',ignore_index=True)
data2

   c1 c2
0   1  a
1   1  b
2   2  c
3   4  d

In [103]:
data=pd.DataFrame({'col1':[1,2,3,4],'col2':['a','b','c','d']})
data

   col1 col2
0     1    a
1     2    b
2     3    c
3     4    d

In [104]:
data['col3']=data['col1'].map(lambda x: x+10)# (=) dyma affection 
data

   col1 col2  col3
0     1    a    11
1     2    b    12
2     3    c    13
3     4    d    14

In [105]:
lettre_to_vc={'a':'v','b':'c','c':'c','d':'c'}
data['col4']=data['col2'].map(lettre_to_vc)#map s'applique sur une serie (une nouvelle col depend d'une autre)

In [106]:
data

   col1 col2  col3 col4
0     1    a    11    v
1     2    b    12    c
2     3    c    13    c
3     4    d    14    c

In [107]:
data=pd.DataFrame({'col1':[-999,2,-1000,4],'col2':['a','b','c','d']})
data

   col1 col2
0  -999    a
1     2    b
2 -1000    c
3     4    d

In [108]:
data.replace([-999,-1000],np.nan, inplace=True)
data

   col1 col2
0   NaN    a
1   2.0    b
2   NaN    c
3   4.0    d

In [109]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],columns=['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [110]:
df2 = pd.DataFrame([['c', 3], ['d', 4]],columns=['letter', 'number'])
df2

  letter  number
0      c       3
1      d       4

In [111]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [112]:
pd.concat([df1, df2],ignore_index=True)

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [113]:
df1=pd.DataFrame({'nom':['Ali', 'Salah', 'Sarra', 'Karim','Med', 'Ramzi'],'Note1':[11,8,5,14,15,6]})

In [114]:
df1

     nom  Note1
0    Ali     11
1  Salah      8
2  Sarra      5
3  Karim     14
4    Med     15
5  Ramzi      6

In [115]:
df2=pd.DataFrame({'nom':['Ali', 'Salah', 'Sarra', 'Karim','Med', 'Ramzi'],'Note2':[13,11,10,16,12,12]})

In [116]:
df2

     nom  Note2
0    Ali     13
1  Salah     11
2  Sarra     10
3  Karim     16
4    Med     12
5  Ramzi     12

In [117]:
pd.merge(df1,df2)

     nom  Note1  Note2
0    Ali     11     13
1  Salah      8     11
2  Sarra      5     10
3  Karim     14     16
4    Med     15     12
5  Ramzi      6     12